// Сторінка складається з таких логічних блоків:
// 🔙 Кнопка «Назад» (Back)
// 🖼️ Фото автомобіля
// 📄 Основна інформація: назва, ID, локація, пробіг, ціна
// 📋 Rental Conditions
// ⚙️ Характеристики авто
// ✅ Додаткові функції
// 📬 Форма бронювання

// | Компонент                | Що відображає                    |
// | ------------------------ | -------------------------------- |
// | `CarDetailsPage`         | Сторінка з усіма елементами      |
// | `CarInfoBlock`           | Назва, ID, локація, пробіг, ціна |
// | `RentalConditions`       | Умови оренди                     |
// | `CarSpecifications`      | Технічні характеристики          |
// | `CarAccessories`         | Список опцій авто                |
// | `BookingForm`            | Форма для бронювання             |
// | `GoBackButton` (опційно) | Кнопка повернення до каталогу    |

export default function CarDetalisPage() {
  return (
    <div>
      <h1>CarDetalisPage</h1>
    </div>
  );
}
